# Задание №1
my_fav_singers = ['Немного нервно', 'Аквариум', 'Stoner Train']
my_fav_singers
print(my_fav_singers)

# Задание №2
locations = []
tomsk = ("56.30","84.58")
haifa = ("2.48","34.59")
locations.append(tomsk)
locations.append(haifa)
print(locations)

#Задание №3
facts = dict()
facts["рост"] = "178"
facts["вес"] = "110"
facts["любимый цвет"] = "синий"

#Задание №4
x = input("Напишите свой вес: ")
y = input("Напишите свой любимый цвет: ")
print(x)
print(y)
print("А мои: ")
print(facts)

#Задание №5
songs = dict()
songs["немного нервно"] = "Жанна"
songs["немного нервно"]
songs["Аквариум"] = "Город"
songs["Аквариум"]
print(songs)

#Задание №6
#Множества!
rndm = set()
rndm = (6,8,43,9)
print(rndm)
# https://pythonworld.ru/tipy-dannyx-v-python/mnozhestva-set-i-frozenset.html

